Revit 2024 API
BuiltInFailures.StairRampFailures.RisersAtSameLocation Property
 The highlighted risers have the same location along the boundary line. Please move one of the two risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RisersAtSameLocation { get; }
Visual Basic
Public Shared ReadOnly Property RisersAtSameLocation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RisersAtSameLocation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace